/*
	File:		Localizable.strings
	Contains:	Localizable strings for chess
	Version:	2.0
	Copyright:	© 2004-2014 by Apple Computer, Inc., all rights reserved.
*/

"gc_automatch"      = "Auto-Match Player";
"gc_opponent"       = "Speak Opponent Moves";
"engine_opponent"   = "Speak Computer Moves";
"cant_duplicate_gc" = "Cannot duplicate Game Center games";

/*
  Single letter piece names P(awn) K(night) B(ishop) R(ook) Q(ueen) K(ing)
  
  According to the PGN standard for chess notation, the following letters
  are used internationally:

  Czech        P J S V D K
  Danish       B S L T D K
  Dutch        O P L T D K
  English      P N B R Q K
  Estonian     P R O V L K
  Finnish      P R L T D K
  French       P C F T D R
  German       B S L T D K
  Hungarian    G H F B V K
  Icelandic    P R B H D K
  Italian      P C A T D R
  Norwegian    B S L T D K
  Polish       P S G W H K
  Portuguese   P C B T D R
  Romanian     P C N T D R
  Spanish      P C A T D R
  Swedish      B S L T D K
*/

"pawn_letter" 	= "P";
"knight_letter"	= "N";
"bishop_letter" = "B";
"rook_letter"   = "R";
"queen_letter"  = "Q";
"king_letter"   = "K";

/* 
 * Full piece names for VoiceOver. We can't decompose into color & piece
 * because of gender agreement requirements in some languages.
 */
"versus"        = "versus";
"select_square" = "select";
"promote_to"    = "promote to";
"king"		= "king";
"queen"		= "queen";
"bishop"        = "bishop";
"knight"        = "knight";
"rook"          = "rook";
"pawn"		= "pawn";
"kings"		= "kings";
"queens"        = "queens";
"bishops"       = "bishops";
"knights"       = "knights";
"rooks"         = "rooks";
"pawns"		= "pawns";
"white_king"	= "white king";
"white_queen"	= "white queen";
"white_bishop"	= "white bishop";
"white_knight"	= "white knight";
"white_rook"	= "white rook";
"white_pawn"	= "white pawn";
"black_king"	= "black king";
"black_queen"	= "black queen";
"black_bishop"	= "black bishop";
"black_knight"	= "black knight";
"black_rook"	= "black rook";
"black_pawn"	= "black pawn";

/* Game outcomes and other title messages */
"new_msg"	= "New Game";
"draw_msg" 	= "Draw!";
"white_win_msg" = "White wins!";
"black_win_msg" = "Black wins!";
"undo_msg"      = "1 Undo";
"undos_msg"     = "%d Undos";
"hint_msg"      = "1 Hint";
"hints_msg"     = "%d Hints";
"illegal_msg"   = "Illegal Move!";
"white_move_msg"= "White to Move";
"black_move_msg"= "Black to Move";
"takeback_msg"  = "Takeback requested";
"casual_game"	 = "Casual Game";
"engine_player" = "Computer";
"cloud_city"    = "Game Center";
"cloud_country" = "The Cloud";

/* Engine thinking mode */
"fixed_depth_mode"  = "Computer thinks 1 move ahead";
"fixed_depths_mode" = "Computer thinks %d moves ahead";
"fixed_time_mode"   = "Computer thinks 1 second per move";
"fixed_times_mode"  = "Computer thinks %d seconds per move";

/* Formats for window title: 
 *
 * title_move_line_fmt  = Move. (... /) <Last Move>
 * title_move_fmt       = <Piece+Origin> (-/x/@) <Destination+Promotion>
 * 	e.g.		  e2-e4     Nf3xe5     b7xa8=R     B@f7
 * title_check_fmt      = <Move> <Check/Checkmate>
 *  e.g.         Bc4xf7+
 * game_title_fmt     	= <White Player> - <Black Player> (<Last Move/Side To Move>)
 *      e.g.              Alekhine - Casablance (3. ... e7 - e6)
 * game_outcome_fmt     = <Game Title>   <Outcome of Game>
 */
"title_move_line_fmt"	= "%@. %@%@";
"title_move_fmt"       = "%@%@%@";
"title_check_fmt"      = "%@%@";
"game_title_fmt"	= "%@ - %@   (%@)";
"game_outcome_fmt"	= "%@   %@";

/* Strings for check / checkmate */
"move_is_check"         = "+";
"move_is_checkmate"     = "≠";

/* Formats for moves in game log. 
 *
 * move_origin_fmt	= <Piece><FromFile><FromRank>
 *     e.g.               e2     Nf3
 * drop_origin_fmt      = <Piece>
 *     e.g.               P      B     R
 * operation_fmt	= - / x / @
 * promo_dest_fmt       = <ToFile><ToRank>=<Piece>
 *     e.g.               a8=Q     d1=N
 * move_dest_fmt        = <ToFile><ToRank>
 *     e.g.               e4       d7
 * dest_check_fmt       = <Dest> <Check/Mate>
 *     e.g.               e4 +     d1=Q ≠
 */
"move_origin_fmt"       = "%@%c%c";
"drop_origin_fmt"       = "%@";
"operation_fmt"         = "%C";
"promo_dest_fmt"        = "%c%c=%@";
"move_dest_fmt"         = "%c%c";
"dest_check_fmt"        = "%@ %@";

/* Draw / Takeback requests */
"draw_request_text"     = "Your opponent offers a draw.";
"draw_request_yes"      = "Accept";
"draw_request_no"       = "Refuse";
"takeback_request_text" = "Your opponent would like to take back the last move.";
"takeback_request_yes"  = "Allow";
"takeback_request_no"   = "Refuse";
"takeback_refused"      = "Your opponent refused to let you take back this move.";
"takeback_refused_ok"   = "OK";

/* Game loading messages */
/*"game_load_fail"        = "Failed to load game";*/
/*"game_load_fail_msg"    = "Chess was unable to load the specified game file. The file may be corrupt or in an improper format.";*/

/* Style names */
"Wood"		= "Wood";
"Metal"		= "Metal";
"Marble"	= "Marble";
"Grass"		= "Grass";
"Fur"		= "Fur";
"Glass"		= "Glass";
